using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
    class DescribingStrings
    {
        static void Main()
        {
            string description = "String-овете дефакто са последователност от символи (char-ове), записана на определен адрес в паметта. Във вид на string може да бъде записана всякаква информация int, double, float, char и т.н. Точно затова и методът ToString() може да бъде използва за почти всякакви типове данни. String-овете имат дължина, която се достъпва чрез свойството Length. Като символни низове, на тях може да се гледа като на масив от char-ове и по тази логика всеки един елемент от стринга може да бъде достъпван чрез индекса си. Индексацията на string-овете е аналогична на тази на масивите -> започва от 0.";
            string methods = "Методи: Класът System.String позволява употребата и обработката на string-овете в C#. Основните методи от този клас са: \n \n Compare(str1, str2) - сравнява два символни низа лексикографски и връща 0, ако са равни, 1 - ако първият елемент трябва да бъде преди втория по лексикографска подредба и (-1) - ако първият елемент трябва да бъде след втория по лексикографска подредба. \n IndexOF(str) - връща индекса на първото срещане на даден стринг в друг. \n LastIndexOf(str) - връща индекса на последния символ на псоледното срещане на дадения string в първоначалния. \n Substring(startIndex, length) - извлича част от низа с начало - позиция startIndex и дължина length. \n Replace(oldStr, newStr) - създава се нов string, в който на мястото на стара част (oldStr) е сложена новата (newStr). \n Remove(startIndex, length) - създва нов символен низ, в който не фигурира частта от първия, зпаочваща от индекс startIndex и е с дължина length. \n ToLower() - прави всички букви в символния низ малки. \n ToUpper() - прави всички букви в символния низ главни. \n Trim() - премахва всички празни символи (или зададени символи в скобите след метода) в началото и края на символния низ. \n Split() - разделя string-а на части по дадени разделители и записва частите в масив от string-ове.";
            Console.WriteLine(description);
            Console.WriteLine();
            Console.WriteLine(methods);
        }
    }
